Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.LoadsBCsOutsideOfHostDuringSplit Property
 Loads or Boundary Conditions outside of splited element boundaries will not be modified during split.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LoadsBCsOutsideOfHostDuringSplit { get; }
Public Shared ReadOnly Property LoadsBCsOutsideOfHostDuringSplit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LoadsBCsOutsideOfHostDuringSplit {
	FailureDefinitionId^ get ();
}
static member LoadsBCsOutsideOfHostDuringSplit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace